// Resourses
var addRes = {
    applicationName: 'Воблака ведаў',
    afterCourseNameSeparator: ': ',

    loginHeader: 'Воблака ведаў',
    registrationHeader: 'Воблака ведаў: рэгістрацыя',
    catalogHeader: 'Воблака ведаў: каталог',
    myCoursesHeader: 'Воблака ведаў: мае курсы',
    settingsHeader: 'Воблака ведаў: налады',
    bookmarksAdditionalHeader: 'абранае',
    journalAdditionalHeader: 'журнал курса',
    contentAdditionalHeader: 'змест',
    contentsHeader: 'Змест',

    wait: 'Калі ласка, пачакайце.',
    unknownError: 'Невядомая памылка',

    yes: 'Так',
    no: 'Не',
    close: 'Закрыць',
    closeApplication: 'Закрыць праграму',
    html5NotSupported: 'Для працы з курсам неабходна ўсталяваць вэб-браўзэр, які падтрымлівае HTML5.',
    user: 'Карыстальнік',
    pass: 'Пароль',
    savePass: 'Захаваць пароль',
    langlabel: 'Мова',
    login: 'Уваход',
    registr: 'Рэгістрацыя',
    role: 'Ролю',
    learner: 'Вучань',
    passwarning: 'Рэкамендуем ўказваць сапраўдны e-mail, на яго будзе высылацца пароль, калі вы яго забудзеце.',
    confpass: 'Пацвярджэнне пароля',

    passDoNotMatch: 'Уведзеныя паролі не супадаюць',
    enterPass: 'Калі ласка, увядзіце новы пароль у палі ўводу',
    wrongEmail: 'Памылка ў полі "E-mail"',
    emptyPass: 'Пра пустое поле "Пароль"',

    download: 'Спампаваць',
    contents: 'Утрыманне',
    courseDownloadingHint: 'Ідзе ўсталёўка курса. ' +
    'Гэта зойме некалькі хвілін у залежнасці ад хуткасці вашага падлучэння да Інтэрнэту, ' +
    'так што ужо хутка вы зможаце прыстцпіць да працы',
    bookmarksDeleted: 'Закладкі выдалены',

    //CoursesList
    start: 'ПАЧАЦЬ',
    activatePIN: 'Актываваць пін',
    activate: 'Актываваць',
    allClasses: 'Усе класы',
    allSubjects: 'Усе прадметы',
    allGenres: 'Усе жанры',
    grade: 'клас',
    grades: 'класы',
    tryIt: 'ПАСПРАБАВАЦЬ',
    buy: 'КУПІЦЬ',
    pointsPrice: 'БАЛАЎ',
    courseIntalling: 'Курс усталёўваецца',
    welcomenote: '<div class="notetxt centertext">Сардэчна запрашаем у «Воблака ведаў»!</div>' +
    '<div class="notetxt">Калі вы набылі наш курс на CD або ў электронным выглядзе, актывізуйце яго з дапамогай ' +
    '<nobr>пін-кода,</nobr> які Вы знойдзеце ў который Вы найдёте ў скрынцы пад дыскам або ў электронным пісьме адпаведна.</div>' +
    '<div class="notetxt">Пакуль вы шукаеце <nobr>пін-код</nobr>, паспрабуйце нашы дэманстрацыйныя курсы задарма.</div>' +
    '<div class="notetxt">Атрымаць поўны спіс курсаў можна ў Каталозе ў верхнім правым куце экрана.</div>',
    oldIE: 'Версія Microsoft Internet Explorer, усталяваная на вашым кампутары, не адпавядае мінімальным ' +
    'тэхнічным патрабаванням комплекса «Воблака ведаў». Для працы з курсам неабходна ўсталяваць вэб-браўзэр ' +
    'Microsoft Internet Explorer версіі 10 або вышэй. Загрузіць яго можна па ' +
    '<a href="http://windows.microsoft.com/ru-ru/internet-explorer/download-ie">адрасу</a>. ' +
    'Пераканайцеся, што ваша аперацыйная сістэма з\'яўляецца ліцэнзійнай.',
    coursesNotFound: 'Курсы, якія задавальняюць вашаму фільтру, не знойдзены',
    courseClosedFirst: 'Вы сапраўды жадаеце спыніць працу з курсам ',
    courseClosedLast: 'і вярнуцца ў каталог курсаў?',

    img: {
        RES_IMG_POINTS: ''
    },

    //Settings
    actions: 'Дзеянні',
    operator: 'Аператар',
    password: 'Пароль',
    repeat: 'Паўтор',
    cancel: 'Адмена',
    change: 'Змяніць',
    changePass: 'Змяніць пароль',
    selfWork: 'Вы працуеце ў сістэме самастойна',
    individualLicense: 'індывідуальная ліцэнзія',
    schoolLicense: 'школьная ліцэнзія',
    runByTeacher: 'Вы працуеце ў сістэме пад кіраваннем настаўніка',
    closeApp: 'Вы сапраўды жадаеце закрыць праграму',
    passDoNotMatch: 'Уведзеныя паролі не супадаюць',
    enterPass: 'Увядзіце новы пароль у поле ўводу',
    wrongEmail: 'Памылка ў поле "E-mail"',
    emptyPass: 'Не запоўнена поле "Пароль"',
    downloadAllCourses: 'Загрузіць усе даступныя курсы',
    confirmationDownloadAllCourses: 'Вы сапраўды жадаеце загрузіць і ўсталяваць усе даступныя вам курсы?',
    version: 'Версія плэера:',
    releaseDate: 'выпушчана',

    connecting: 'Ідзе падлучэнне да сервера.<br/>Калі ласка, пачакайце некалькі секунд.',
    connectingTest: 'Ідзе падлучэнне да <span class="pinhintred">тестовому</span> сервера.<br/>' +
    'Калі ласка, пачакайце некалькі секунд.',

// Tooltips

    synchronizedTooltip: 'Анлайн-рэжым: вынікі працы захоўваюцца на серверы',
    synchronizeFailTooltip: 'Афлайн-рэжым: каб захаваць вынікі на серверы, далучыцеся да Інтэрнэта',
    leftPanelTooltip: 'Спіс сцэн',
    homeTooltip: 'Каталог курсаў',
    bookmarksTooltip: 'Абранае',
    courseTooltip: 'Работа з курсам',
    journalTooltip: 'Журнал',
    helpTooltip: 'Інструкцыя карыстальніка',
    settingsTooltip: 'Налады',
    addBookmarkTooltip: 'Дадаць у абранае',
    removeBookmarkTooltip: 'Выдаліць з абранага',

// Journal
    clearJournal: 'Ачысціць журнал',
    journalDeleted: 'Журнал выдален',
    confirmationClearJournal: 'Вы сапраўды жадаеце ачысціць журнал курса?',
    of: 'з',
    task: 'Заданне',
    time: 'Час',
    passed: 'Пройдзена',
    points: 'Балы',
    examTestScore: 'Тэставы бал за экзамен',
    spentTime: 'Затрачаны<br/>час',
    viewed: 'Прагледжана',
    totalPoints: 'Набрана<br/>балаў',
    paragraph: 'Параграф',
    journalPara: 'журнал §',
    journalT: 'журнал Т',
    journalE: 'журнал Э',
    gotoTask: 'Перайсці да задання',
    return: 'Вярнуцца',
    incorrect: 'Няправільна',
    correct: 'Правільна',
    status: 'Статус',
    reviewed: 'Прагледжана',
    not_reviewed: 'Не прагледжана',
    title: 'Назва',
    date: 'Дата',
    primaryScore: 'Першасны<br/>бал',
    testScore: 'Тэставы<br/>бал',
    duration: 'Працягласць',

// Slide
    next: 'Далей',
    check: 'Праверыць',
    solution: 'Рашэнне',
    reload: 'Абнавіць',
    save: 'Захаваць',
    search: 'Пошук',
    finish: 'Скончыць',
    finishTooltip: 'Скончыць тэст і перадаць вынікі на праверку',
    addNote: 'Дадаць нататку',
    nextSlideTooltip: 'Да наступнага задання',
    prevSlideTooltip: 'Да папярэдняга задання',
    hidePanelTooltip: 'Згарнуць спіс сцэн',
    lookFor: 'Шукаць',
    searchTooltip: 'Увядзіце слова для пошука',
};

var countriesList = ['Расія', 'Абхазія', 'Аўстралія', 'Аўстрыя', 'Азербайджан', 'Албанія', 'Алжыр', 'Ангола', 'Аргентына', 'Арменія', 'Аўганістан', 'Бангладэш', 'Бахрэйн', 'Беларусія', 'Бельгія', 'Бенін', 'Балагрыя', 'Балівія', 'Боснія і Герцагавіна', 'Батсвана', 'Бразілія', 'Брунэй', 'Бурундзі', 'Ватыкан', 'Велікабрытанія', 'Венгрыя', 'Венесуэла', 'В\'етнам', 'Габон', 'Гайана', 'Гана', 'Гватэмала', 'Гвиінэя-Бісау', 'Гвінэя', 'Германія', 'Грэцыя', 'Грузія', 'Данія', 'Дэмакратычная Рэспубліка Конга', 'Джыбуті', 'Егіпет', 'Замбія', 'Зімбабвэ', 'Ізраіль', 'Індыя', 'Інданэзія', 'Іарданія', 'Ірак', 'Іран', 'Ірландыя', 'Ісландыя', 'Іспанія', 'Італія', 'Йемэн', 'Каба-Вердзе', 'Казахстан', 'Камбоджа', 'Камерун', 'Канада', 'Катар', 'Кенія', 'Кіпр', 'Кіргізія', 'КНДР', 'КНР', 'Калумбія', 'Коста-Рыка', 'Кот-д’Івуар', 'Куба', 'Кувейт', 'Лаос', 'Латвія', 'Ліван', 'Лівія', 'Літва', 'Люксембург', 'Маврікій', 'Маўрытанія', 'Мадагаскар', 'Македонія', 'Малайзія', 'Малі', 'Мальта', 'Марока', 'Мексіка', 'Мазамбік', 'Малдавія', 'Манголія', 'М\'янма', 'Намібія', 'Катманду', 'Нігерыя', 'Нідэрланды', 'Нікарагуа', 'Новая Зеландыя', 'Нарвегія', 'ОАЭ', 'Аман', 'Пакістан', 'Палестіна', 'Панама', 'Парагвай', 'Перу', 'Польша', 'Партугалія', 'Рэспубліка Конга', 'Рэспубліка Карэя', 'Руанда', 'Румынія', 'Сан-Марына', 'Саудаўская Аравія', 'Сейшэльскія Астравы', 'Сенегал', 'Сербія', 'Сінгапур', 'Сірыя', 'Славакія', 'Славенія', 'Судан', 'США', 'Таджыкістан', 'Таіланд', 'Танзанія', 'Туніс', 'Туркменія', 'Турцыя', 'Уганда', 'Узбекістан', 'Украіна', 'Уругвай', 'Філіпіны', 'Фінляндыя', 'Францыя', 'Харватыя', 'Цэнтральнаафрыканская Рэспубліка', 'Чад', 'Чэрнагорыя', 'Чэхія', 'Чылі', 'Швейцарыя', 'Швецыя', 'Шры-Ланка', 'Эквадор', 'Эрытрэя', 'Эстонія', 'Эфіопія', 'ЮАР', 'Южная Асетыя', 'Ямайка', 'Японія'];
